In [2]:
import pandas as pd

In [4]:
df1=pd.DataFrame({'Month':['Jan','Feb','Mar','Jan','Feb','Mar'],'Product':['A','A','A','B','B','B'],'Sales':[150,200,250,300,400,500]})

#1. Group the data by Product and calculate the total Sales for each product.

In [8]:
df1.groupby('Product')['Sales'].sum()

Product
A     600
B    1200
Name: Sales, dtype: int64

#2. Find the month with the highest sales for each product.

In [44]:
res=df1.loc[df1.groupby('Product')['Month'].idxmax()]
res['Month']

2    Mar
5    Mar
Name: Month, dtype: object

#3. Add a new column Sales_Percentage which represents the percentage
contribution of each sale to the total sales of that product.

In [24]:
df1['Sales_percentage']=df1['Sales']/df1['Sales'].sum() *100
df1

  Month Product  Sales  Sales_percentage
0   Jan       A    150          8.333333
1   Feb       A    200         11.111111
2   Mar       A    250         13.888889
3   Jan       B    300         16.666667
4   Feb       B    400         22.222222
5   Mar       B    500         27.777778

Handling Missing Data:

In [28]:
df2=pd.DataFrame({'Name':['John','Doe','Jane','Anna','Smith'],'Department':['HR','Finance',None,'IT','HR'],'Salary':[50000,60000,55000,None,58000]})

1. Identify and count the number of missing values in each column.

In [56]:
df2.isnull().sum()

Name          0
Department    0
Salary        1
dtype: int64

#2. Fill the missing values in the Department column with the mode of the column.

In [62]:
df2['Department']=df2['Department'].fillna(df2['Department'].mode()[0])
df2

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT  55750.0
4  Smith         HR  58000.0

3. Fill the missing values in the Salary column with the mean of the column.

In [60]:
df2['Salary']=df2['Salary'].fillna(df2['Salary'].mean())
df2

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT  55750.0
4  Smith         HR  58000.0

4. Drop any rows that still contain missing values.

In [72]:
df2=pd.DataFrame({'Name':['John','Doe','Jane','Anna','Smith'],'Department':['HR','Finance',None,'IT','HR'],'Salary':[50000,60000,55000,None,58000]})
df2

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane       None  55000.0
3   Anna         IT      NaN
4  Smith         HR  58000.0

In [78]:
df2.dropna()

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
4  Smith         HR  58000.0

In [80]:
df2.dropna(axis=1)

    Name
0   John
1    Doe
2   Jane
3   Anna
4  Smith

In [82]:
df2

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane       None  55000.0
3   Anna         IT      NaN
4  Smith         HR  58000.0

4.## Series Operations:

In [84]:
temp=pd.Series([23,21,20,25,27,30,28,22,24,26])

In [86]:
temp

0    23
1    21
2    20
3    25
4    27
5    30
6    28
7    22
8    24
9    26
dtype: int64

1. Calculate the mean, median, and standard deviation of the series.

In [88]:
temp.mean()

24.6

In [90]:
temp.median()

24.5

In [92]:
temp.std()

3.204163957519444

2. Create a new Series temperature_celsius that converts the temperature from
Fahrenheit to Celsius

In [94]:
temp1=pd.Series((temp-32)*5/9)

In [96]:
temp1

0   -5.000000
1   -6.111111
2   -6.666667
3   -3.888889
4   -2.777778
5   -1.111111
6   -2.222222
7   -5.555556
8   -4.444444
9   -3.333333
dtype: float64

Find the index of the maximum and minimum values in the original temperature
series.

In [98]:
temp.idxmax()

5

In [100]:
temp.idxmin()

2

Sort the Series in ascending and descending order.

In [108]:
temp.sort_values()

2    20
1    21
7    22
0    23
8    24
3    25
9    26
4    27
6    28
5    30
dtype: int64

In [110]:
temp.sort_values(ascending=False)

5    30
6    28
4    27
9    26
3    25
8    24
0    23
7    22
1    21
2    20
dtype: int64